app/controllers/properties_controller.rb

  def index
    @properties = Property.all
---
SELECT * FROM `properties`

  def show
    @property = Property.find(params[:id])
---
SELECT * FROM `properties` WHERE (`properties`.`id` = 1)

  def edit
    @property = Property.find(params[:id])
---
SELECT * FROM `properties` WHERE (`properties`.`id` = 5)

  def create
    @property = Property.new(params[:property])

    respond_to do |format|
      if @property.save
---
INSERT INTO `properties` (`name`, `created_at`, `no_of_bedrooms`, `updated_at`, `area`, `description`, `no_of_bathrooms`) VALUES('Splender Properties', '2010-08-19 10:47:29', 3, '2010-08-19 10:47:29', 900, 'This is a splender property', 2)

  def update
    @property = Property.find(params[:id])

    respond_to do |format|
      if @property.update_attributes(params[:property])
---
SELECT * FROM `properties` WHERE (`properties`.`id` = 5)
UPDATE `properties` SET `updated_at` = '2010-08-25 07:06:50', `description` = 'nice' WHERE `id` = 7

  def destroy
    @property = Property.find(params[:id])
    @property.destroy
---
SELECT * FROM `properties` WHERE (`properties`.`id` = 3)
DELETE FROM `properties` WHERE `id` = 3