app/controllers/users_controller.rb

SELECT * FROM `users`
---
  def index
    @users = User.all

SELECT * FROM `users` WHERE (`users`.`id` = 2)
---
  def show
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 3)
---
  def edit
    @user = User.find(params[:id])

INSERT INTO `users` (`name`, `created_at`, `updated_at`, `nick_name`, `email`) VALUES('Tushar', '2010-08-19 07:42:28', '2010-08-19 07:42:28', 'gg', 'tush@gmail.co')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 3)
UPDATE `users` SET `updated_at` = '2010-08-19 08:57:48', `name` = 'Tushar bogawat' WHERE `id` = 3
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 3)
DELETE FROM `users` WHERE `id` = 3
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy